Revit 2026 API

# LineLoadEndPoint Property

---

Returns the three dimensional location of the end point for the line load.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ EndPoint { get; }
```
```vb
Public ReadOnly Property EndPoint As XYZ
	Get
```
```cpp
public:
property XYZ^ EndPoint {
	XYZ^ get ();
}
```
```fsharp
member EndPoint : XYZ with get
```

#### Property Value

XYZ

The location of the end point is measured in decimal feet.

#### Reference

LineLoad Class

Autodesk.Revit.DB.Structure Namespace